; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v4 - type_3 ?v7 - type_2)
 	      (pred_3 ?v8 - object ?v7 - type_2)
	      (pred_2 ?v4 - type_3 ?v6 - type_1)
	      (pred_1 ?v4 - type_3 ?v8 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v4 - type_3 ?v2 ?v3 - type_2)
       :precondition (and  (pred_4 ?v4 ?v2))
       :effect (and  (pred_4 ?v4 ?v3)
		     (not (pred_4 ?v4 ?v2))))

   (:action op_1
       :parameters (?v4 - type_3 ?v1 - object ?v5 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v5) (pred_4 ?v4 ?v5) (pred_2 ?v4 ?v6))
       :effect (and (pred_1 ?v4 ?v1 ?v6)
		    (not (pred_3 ?v1 ?v5)) 
		    (not (pred_2 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_3 ?v1 - object ?v5 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v1 ?v6) (pred_4 ?v4 ?v5))
       :effect (and (pred_3 ?v1 ?v5)
		    (pred_2 ?v4 ?v6)
		    (not (pred_1 ?v4 ?v1 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_3
obj_09 obj_03 - type_1
obj_08 obj_01 obj_02 - type_2
obj_06 obj_05 obj_07 - object)
(:init
(pred_4 obj_04 obj_02)
(pred_2 obj_04 obj_09)
(pred_2 obj_04 obj_03)
(pred_3 obj_06 obj_02)
(pred_3 obj_05 obj_01)
(pred_3 obj_07 obj_02)
)
(:goal
(and
(pred_3 obj_06 obj_02)
(pred_3 obj_05 obj_08)
(pred_3 obj_07 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_04 ?b obj_03))))
)
)

; plan
1. (op_3 obj_04 obj_02 obj_01)
   deleted: (pred_4 obj_04 obj_02)
   added: (pred_4 obj_04 obj_01)
   goals met: 2 of 3
2. (op_1 obj_04 obj_05 obj_01 obj_09)
   deleted: (pred_3 obj_05 obj_01) (pred_2 obj_04 obj_09)
   added: (pred_1 obj_04 obj_05 obj_09)
   goals met: 2 of 3
3. (op_3 obj_04 obj_01 obj_08)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_08)
   goals met: 2 of 3
4. (op_2 obj_04 obj_05 obj_08 obj_09)
   deleted: (pred_1 obj_04 obj_05 obj_09)
   added: (pred_3 obj_05 obj_08) (pred_2 obj_04 obj_09)
   goals met: 3 of 3
